{
	"tools": [ 	
	{
		"category": "pho",
		"name": "Protecting Workloads on AWS from the Instance to the Edge",
		"tags": "protect, preventive, firewall, WAF, ALB, load balancer, web, Linux, CloudWatch, Inspector, Systems Manager, EC2", 
		"time": "2",
		"externallyaccessible": "yes",
		"level": 300,
		"type": "Workshop",
		"description": "In this workshop, you will build an environment consisting of two Amazon Linux web servers behind an application load balancer. The web servers will be running a PHP web site that contains several vulnerabilities. You will then use AWS Web Application Firewall (WAF), Amazon Inspector and AWS Systems Manager to identify the vulnerabilities and remediate them.",
		"location": "https://protecting-workloads.awssecworkshops.com/"
		
	},
	
	{
		"category": "security",
		"name": "WAF Classic Workshop (not v2)",
		"tags": "waf, firewall, CloudFront, DDoS, threat, automation",
		"time": "1-2",
		"externallyaccessible": "yes",
		"level": 200,
		"type": "Workshop",
		"description": "This workshop introduces AWS WAF and the AWS WAF Security Automations solution.The AWS WAF enables customers to create rules to block common attack patterns, administered via APIs. The Security Automation Solution extends WAF by deploying a set of preconfigured rules to protect applications. These rules can be customised for your application.",
		"location": "https://github.com/aws-samples/aws-waf-classic-workshop"
		
	},

	{ 
		"category": "security",
		"name": "Protect with WAF (Classic)",
		"tags": "waf, firewall, CloudFront, DDoS, threat, automation",
		"time": "1-2",
		"externallyaccessible": "Yes",
		"level": 300,
		"type": "Workshop",
		"description": "In the labs you will get familar with AWS WAF and how you can use it protect a web application. For lab1 you will perform some common web application attacks and then you will implement an AWS WAF to protect your application from these exposures without the need to update any web application code. For lab2 you will use additional tools to create automations which will dynamically add AWS WAF protections from more advanced attacks.",
		"location": "https://github.com/gtaws/ProtectWithWAF"
	}, 	
	
	{ 
		"category": "security",
		"name": "Security Hub",
		"tags": "detect, respond, recover, IAM, GuardDuty, Macie, Security Hub, Inspector",
		"time": "1-2",
		"externallyaccessible": "Yes",
		"level": 200,
		"type": "Workshop",
		"description": "This workshop is broken into two sections. The first section will guide you through a demonstration of features and functions of Security Hub. The second sectionis a lab thatwill show you how to buildInsights, CustomActions,and Integrations.",
		"location": "https://ee-assets-prod-us-east-1.s3.amazonaws.com/modules/a6522c879e784c2086013230d57cfe73/v3/Security-Hub-Workshop-Guide-2019-security-summit.pdf"
	}, 
	{ 
		"category": "security",
		"name": "Scaling Threat Detection & Response",
		"tags": "detect, respond, recover,  GuardDuty, SIEM, monitoring, alerts",
		"time": "2-3",
		"externallyaccessible": "Yes",
		"level": 200,
		"type": "Workshop",
		"description": "This workshop is designed to help you get familiar with AWS Security services and learn how to use them to identify and remediate threats in your environment. You'll be working with services such as Amazon GuardDuty (threat detection), Amazon Macie (discover, classify & protect data), Amazon Inspector (vulnerability & behavior analysis), AWS Security Hub (centralized security view). You will learn how to use these services to investigate threats during and after an attack, set up a notification and response pipeline, and add additional protections to improve the security posture of your environment.",
		"location": "https://automating-threat-detection.awssecworkshops.com/"
	}, 

	{ 
		"category": "security",
		"name": "Hands on with Amazon GuardDuty",
		"tags": "GuardDuty, SIEM, attack, CloudWatch Event Rules, Lambda, protect, detect, respond, preventive, detective, responsive",
		"time": "1-2",
		"externallyaccessible": "Yes",
		"level": 300,
		"type": "Builder Session",
		"description": "This repository walks you through a scenario covering threat detection and remediation using Amazon GuardDuty; a managed threat detection service. The scenario simulates an attack that spans a few threat vectors, representing just a small sample of the threats that GuardDuty is able to detect. In addition, you will look at how to view and analyze GuardDuty findings, how to send alerts based on the findings, and, finally, how to remediate findings.",
		"location": "https://hands-on-guardduty.awssecworkshops.com/"
	}, 

	{ 
		"category": "data",
		"name": "Cloud-Native Infrastructure Security",
		"tags": "prevent, detect, CloudWatch, CloudTrail, GuardDuty, Config, Security Groups, Network ACLs",
		"time": "1",
		"externallyaccessible": "Yes",
		"level": 200,
		"type": "Builder Session",
		"description": "Whether you are migrating existing workloads or creating something new in AWS, it can be tempting to bring your current security solutions with you. In this hands-on workshop, we help you identify which cloud-native solutions can mitigate the same risks while providing scalability, reliability, and cost optimization at a low operational burden. During this workshop, you will learn how to use cloud native controls like CloudTrail, Security Groups, GuardDuty and many more, to secure your cloud architecture.",
		"location": "https://ec2-infra-sec.awssecworkshops.com/"
	}, 
	{ 
		"category": "data",
		"name": "Using AWS Secrets Manager with Amazon RDS and AWS Fargate - Scenario",
		"tags": "prevent, Secrets Manager, RDS, Fargate, Linux, Docker, SSH, preventive",
		"time": "1",
		"externallyaccessible": "Yes",
		"level": 300,
		"type": "Builder Session",
		"description": "This Secrets Manager Builder Session guides you through the use of AWS Secrets Manager with Amazon RDS and AWS Fargate. In the first phase of the Builder Session, you will access the RDS data base with Secrets Manager. You will then use Secrets Manager to rotate the data base password. You will then use Secrets Manager to access the data base again to show that you can continue to access the data base after the rotation.",
		"location": "https://secrets-manager.awssecworkshops.com/RDSFargate/"
	}, 
	{ 
		"category": "Data", 
		"name": "IAM Permission Boundaries",
		"tags": "identity, IAM, policy, JSON",
		"time": "1",
		"externallyaccessible": "Yes",
		"level": 200,
		"type": "Builder Session",
		"description": "Permission boundaries is probably one of the most important new IAM features that has launched in a while. This feature addresses a longstanding customer issue, namely, how do I delegate administration to my users. If you have system administrators that need to be able to create IAM roles and users, developers that need to be able to create roles for Lambda functions, or any similar scenario, then you need permission boundaries.",
		"location": ""
	}, 
	{ 
		"category": "data",
		"name": "IAM Permissions boundary workshop Advanced",
		"tags": "identity, protect, preventive, IAM, roles, users, policy, Lambda",
		"time": "2",
		"externallyaccessible": "Yes",
		"level": 400,
		"type": "Workshop",
		"description": "In this workshop, you learn how to secure access permissions for multiple teams operating in a single AWS account. We provide an example three-tier web application running in production, and you practice delegating permissions to web administrators so they can modify only their own resources without impacting the permissions needed to do their job.All attendees need a laptop, an active AWS Account, an AWS IAM Administrator, and a familiarity with core AWS services.",
		"location": "https://awssecworkshops.com/builder-sessions/permission-boundary/build"
	}, 
	{ 
		"category": "data",
		"name": "Access Delegation",
		"tags": "identity, protect, preventive",
		"time": "2",
		"externallyaccessible": "Yes",
		"level": 200,
		"type": "Workshop",
		"description": "In this workshop you will learn how to use Amazon IAM to delegate access to these services to AWS Security Administrators and AWS Security Operators. AWS Security Administrators require full access to AWS security services while AWS Security Operators only require read only access to the services. You will use AWS IAM roles to do this and thereby promote the Principle of Least Privilege - giving users the minimum level of privilege they need to do their tasks.",
		"location": "https://identity-round-robin.awssecworkshops.com/delegation/"
	}, 
	{ 
		"category": "data",
		"name": "Serverless Identity",
		"tags": "identity, protect, preventive, Cognito, serverless, IAM, S3, CloudFront, Cognito",
		"time": "1-2",
		"externallyaccessible": "Yes",
		"level": 300,
		"type": "Workshop",
		"description": "In this workshop you will be focused on improving the identity controls of the a serverless application. You will get exposed to different identity concepts through the use of a variety of services such as AWS IAM, Amazon S3, Amazon CloudFront, and Amazon Cognito. Upon completion you should have a better idea of how to use native AWS identity controls to improve the security posture of a serverless application.",
		"location": "https://identity-round-robin.awssecworkshops.com/serverless/"
	}, 
	{ 
		"category": "data",
		"name": "Using Amazon Cognito for serverless consumer apps",
		"tags": "protect, preventive, Cognito, serverless",
		"time": "2",
		"externallyaccessible": "Yes",
		"level": 400,
		"type": "Workshop",
		"description": "In this workshop, you learn how to build a serverless customer-facing microservices application demonstrating end-to-end authentication and authorization using Amazon Cognito, Amazon API Gateway, AWS Lambda, and all things AWS Identity and Access Management (IAM). You have the opportunity to build an end-to-end functional app with a secure identity provider showcasing user authentication patterns.",
		"location": "https://serverless-idm.awssecworkshops.com/"
	},
	{ 
		"category": "data",
		"type": "data",
		"name": "DevSecOps: Integrating security into pipelines",
		"tags": "DevSecOps, code, lifecycle, CodePipeline, Lambda, CloudFormation",
		"time": "2",
		"externallyaccessible": "Yes",
		"level": 300,
		"type": "Workshop",
		"description": "In this workshop, you practice running an environment with a test and production deployment pipeline. Along the way, we cover topics such as static code analysis, dynamic infrastructure review, and workflow types. You also learn how to update your process in response to security events. As an example, we write new AWS Lambda functions, aligned with controls, to automate security at scale.",
		"location": "https://devops.awssecworkshops.com/"
	},
	{ 
		"category": "data",
		"name": "Data Protection - Series of workshops",
		"tags": "encryption, certificate, ACM, Certificate Manager, X.509, CA, KMS",
		"time": "6",
		"externallyaccessible": "Yes",
		"level": 300,
		"type": "Workshop",
		"description": "These workshops demonstrates server side encryption, client side encryption and certfificate management concepts within AWS.",
		"location": "https://data-protection.awssecworkshops.com/"
	},
	{ 
		"category": "data",
		"name": "Amazon S3 Security Settings and Controls",
		"tags": "S3, Config, protect, preventive, detect, policy, respond",
		"time": "1",
		"externallyaccessible": "Yes",
		"level": 200,
		"type": "Workshop",
		"description": "In this workshop you will use IAM, S3 Bucket Policies, S3 Block Public Access and AWS Config to demonstrate multiple strategies for securing a S3 Bucket.",
		"location": "https://github.com/aws-samples/amazon-s3-security-settings-and-controls"
	},
	{ 
		"category": "data",
		"name": "Securing your EKS",
		"tags": "containers, Kubernetes, IAM, Cloud9, cli, developer, preventive, firewall, network policy",
		"time": "1-2",
		"externallyaccessible": "Yes",
		"level": 400,
		"type": "Builder Session",
		"description": "AWS IAM mapping to Kubernetes RBAC and least privilege on k8s , securely managing Kubernetes Secrets w/RBAC & namespaces, assuming IAM roles to use AWS CLI/SDK within pods, making the control plane endpoints private & DNS repercussions, enabling Network Policies for in-Kubernetes ‘firewall’ rules, enabling and parsing the audit trail for EKS control plane activity.",
		"location": "https://github.com/aws-samples/con317-reinvent19"
	},
	{ 
		"category": "data",
		"name": "Securing Serverless Workloads",
		"tags": "protect, preventive, Cognito, serverless, API, Lambda",
		"time": "1-2",
		"externallyaccessible": "Yes",
		"level": 300,
		"type": "Workshop",
		"description": "In this workshop, you will learn techniques to secure a serverless application built with AWS Lambda, Amazon API Gateway and RDS Aurora. We will cover AWS services and features you can leverage to improve the security of a serverless applications in 5 domains: identity & access management, infrastructure, data, code, logging & monitoring",
		"location": "https://github.com/aws-samples/aws-serverless-security-workshop/blob/master/README.md"
	},
	{ 
		"category": "data",
		"name": "Security Automation",
		"tags": "protect, preventive, CloudTrail, automation, S3, GuardDuty, monitoring, security groups",
		"time": "1-2",
		"externallyaccessible": "Yes",
		"level": 300,
		"type": "Workshop",
		"description": "This workshop you will build, CloudTrail Automation, Security Groups Monitoring & Automation, S3 Bucket permission monitoring, Automate responses for GuardDuty, and Region Compliance",
		"location": "https://louay-workshops.com.au/security-automation-workshop.html"
	}
		
	]
	
}
